app/views/home/index.html.erb

SELECT "users".* FROM "users"
---
<div class="user-name"><% if user_signed_in? %>WelCome <%= current_user.first_name %>&nbsp;<%= current_user.last_name %><% end %></div>