app/views/user_relations/pending_requests.html.erb

  <tr>
    <td><%= User.find(user_relation.request_user_id).username %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1