app/controllers/user_relations_controller.rb

SELECT "user_relations".* FROM "user_relations"
---
  def index
    @user_relations = UserRelation.all

SELECT "user_relations".* FROM "user_relations" WHERE "user_relations"."id" = $1 LIMIT 1  [["id", "send_request"]]
---
  def show
    @user_relation = UserRelation.find(params[:id])

INSERT INTO "user_relations" ("created_at", "receiver_user_id", "request_status", "request_user_id", "security", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def send_request
    @user_relation_sender = UserRelation.create(:request_status => 'pending', :request_user_id => current_user.id,
                                                :receiver_user_id => params[:user_id], :security => current_user.security)

SELECT "user_relations".* FROM "user_relations" WHERE (receiver_user_id=4 AND request_status='pending')
---
  def pending_requests
    @user_relations = UserRelation.where('receiver_user_id=? AND request_status=?', current_user.id.to_s, 'pending')

SELECT "user_relations".* FROM "user_relations" WHERE ((receiver_user_id='1' AND request_user_id='2') OR (receiver_user_id='2' AND request_user_id='1'))
---
  def accept_request
    @user_relations = UserRelation.where('(receiver_user_id=? AND request_user_id=?) OR (receiver_user_id=? AND request_user_id=?)', current_user.id.to_s, params[:id].to_s, params[:id].to_s, current_user.id.to_s)