app/controllers/users_controller.rb

SELECT "user_relations".* FROM "user_relations" WHERE (receiver_user_id='1' AND request_status='accepted')
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def friends_list
    @friends = []
    @user_relations = UserRelation.where("receiver_user_id=? AND request_status=?", current_user.id.to_s, "accepted")
    @user_relations.each do |ur|
      @friends << User.where("id=?", ur.request_user_id.to_s)